
&НаКлиенте
Процедура СравнитьФайлыПоХешСумме(Команда)
	СравнитьФайлыПоХешСуммеНаСервере();
КонецПроцедуры

&НаСервере
Процедура СравнитьФайлыПоХешСуммеНаСервере()
	// Вставить содержимое обработчика.
	МассивФайловПоМаске1 = ПолучитьМассивФайлКаталога(СокрЛП(Каталог1),СокрЛП(МаскаФайлов));
	МассивФайловПоМаске2 = ПолучитьМассивФайлКаталога(СокрЛП(Каталог2),СокрЛП(МаскаФайлов));

	//порядок сравнения вставить
	если СравнитьКаталог1и2 тогда 
	массивдляпереборафайлов = МассивФайловПоМаске1;
	иначе
	массивдляпереборафайлов = МассивФайловПоМаске2;
	КонецЕсли;
		
	ПроверитьФайлы(массивдляпереборафайлов,СравнитьКаталог1и2,Каталог1,каталог2);
		
КонецПроцедуры

&НаСервере
процедура ПроверитьФайлы(массивфайлов,сравним1и2,папка1,папка2)
	
	МассивНовыхФайлов = новый массив;
	МассивУдаленныхФайлов = новый массив;
	МассивИзмененных = Новый Массив;
	для каждого элемент из массивфайлов цикл
		ФайлПервый = элемент.ПолноеИмя;
		Если сравним1и2 тогда 
			файлВторой = СтрЗаменить(файлПервый,папка1,папка2);
		Иначе 
			файлВторой = СтрЗаменить(ФайлПервый,папка2,папка1);
		КонецЕсли;	
		
		
		ЕстьФайл1 = ПроверкаСуществованиеФайла(ФайлПервый);
		ЕстьФайл2 = ПроверкаСуществованиеФайла(файлВторой);
		
		Хеш1 = неопределено;
		Хеш2 = неопределено;
		
		Если ЕстьФайл1 тогда
			Хеш1 = ХешСуммаФайла(ФайлПервый); 
		КонецЕсли;
		
		Если ЕстьФайл2 тогда
			Хеш2 = ХешСуммаФайла(файлВторой); 
		КонецЕсли;
		
		Если не хеш1 = неопределено тогда 
			Если Хеш1 = Хеш2 тогда 
				//сообщить("ФайлыРавны !");
			Иначе 
				МассивИзмененных.Добавить(элемент);
			КонецЕсли;
		Иначе
			Сообщить("Файл 2 новый");
		КонецЕсли;
		
		Если Хеш2 = неопределено и не сравним1и2 тогда
			МассивНовыхФайлов.Добавить(элемент);
		иначеЕсли хеш2 = неопределено и сравним1и2 тогда
			МассивУдаленныхФайлов.Добавить(элемент);
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры
 
функция ПроверкаСуществованиеФайла(ИмяФайла)
	
	файлПроверка = новый файл(имяфайла);
	возврат файлПроверка.Существует() ;
КонецФункции

Функция ХешСуммаФайла(ИмяФайла)

	 Хеш = Новый ХешированиеДанных(ХешФункция.MD5);
	 Хеш.ДобавитьФайл(ИмяФайла);
     Возврат Хеш.ХешСумма;

КонецФункции

Функция ПолучитьМассивФайлКаталога(ИмяКаталога,МаскаФайлов)
	МассивФайловПоМаске = НайтиФайлы(ИмяКаталога,МаскаФайлов,истина);	
	Возврат МассивФайловПоМаске;
КонецФункции
