&Вместо("ВыполнитьВыгрузкуКонфигурацииВXML")
Процедура ДВС_ВыполнитьВыгрузкуКонфигурацииВXML(Параметры)

	Если Параметры.ВыгрузкуКонфигурацииВXML Тогда
		
		ТекДата = формат(текущаядата(),"ДФ='yyyy-MM-dd ЧЧмм'");
	
		ДобавитьЗаписьВЛог(Параметры, НСтр("ru='Начало выгрузки конфигурации в XML'"));

		СтрокаКоманды = "%КаталогИсполняемогоФайла%1cv8  DESIGNER /WA- /DisableStartupDialogs
		| %СтрокаСоединенияИБДляЗагрузкиМетаданных%
		| /N ""%ИмяПользователяИБДляЗагрузкиМетаданных%"" /P ""%ПарольПользователяИБДляЗагрузкиМетаданных%""
	    | /DumpConfigToFiles ""%КаталогВыгрузкиКонфигурации%"" -format Hierarchical"; 
		
		КаталогВыгрузкиБазовый = Параметры.КаталогВыгрузкиКонфигурации;
		ФайлДляОтслежки = КаталогВыгрузкиБазовый+"\ConfigDumpInfo.xml"; 
		
		Если не параметры.проект.ПерваяВыгрузка_ДВС тогда
		СтрокаКоманды = Строкакоманды +" -update -configDumpInfoForChanges ""%ФайлДляОтслежки%"""; //выгружает сверяясь с текущим файлом configdumpinfo.xml
		//-getChanges ""%ФайлИзмененийКонфигурации%"""; // не работает в версии 8.3.16 одновременно с ключом update
		КаталогВыгрузки = СокрЛП(параметры.проект.ПутьВыгрузкиПатча);
		Иначе 
		КаталогВыгрузки = КаталогВыгрузкиБазовый;
		КонецЕсли;
		СтрокаКоманды = СтрокаКоманды + " /DumpResult ""%ИмяФайлаРезультатов%"" /Out ""%ИмяФайлаЛогов%"" -NoTruncate";
		
		СтрокаКоманды = СтрЗаменить(СтрокаКоманды,"%КаталогИсполняемогоФайла%", Параметры.КаталогИсполняемогоФайла);
		СтрокаКоманды = СтрЗаменить(СтрокаКоманды,"%ИмяФайлаЛогов%", Параметры.ИмяФайлаЛогов);
		СтрокаКоманды = СтрЗаменить(СтрокаКоманды,"%СтрокаСоединенияИБДляЗагрузкиМетаданных%", Параметры.СтрокаСоединенияИБДляЗагрузкиМетаданных);
		СтрокаКоманды = СтрЗаменить(СтрокаКоманды,"%ИмяПользователяИБДляЗагрузкиМетаданных%", Параметры.ИмяПользователяИБДляЗагрузкиМетаданных);
		СтрокаКоманды = СтрЗаменить(СтрокаКоманды,"%ПарольПользователяИБДляЗагрузкиМетаданных%", Параметры.ПарольПользователяИБДляЗагрузкиМетаданных);
		СтрокаКоманды = СтрЗаменить(СтрокаКоманды,"%ФайлДляОтслежки%",ФайлДляОтслежки);
		
		СтрокаКоманды = СтрЗаменить(СтрокаКоманды,"%КаталогВыгрузкиКонфигурации%", КаталогВыгрузки);
		
		//1свд
			
		если параметры.проект.ПлоскийФорматВыгрузки_ДВС тогда
			СтрокаКоманды = СтрЗаменить(СтрокаКоманды,"Hierarchical","Plain");
		КонецЕсли;
				
		ФайлИзменений = КаталогВыгрузкиБазовый+"\diff"+ТекДата+".txt";
		ФайлРезультатов =  КаталогВыгрузкиБазовый+"\DumpInfo"+ТекДата+".log";
		СтрокаКоманды = СтрЗаменить(СтрокаКоманды,"%ФайлИзмененийКонфигурации%",ФайлИзменений);
		СтрокаКоманды = СтрЗаменить(СтрокаКоманды,"%ИмяФайлаРезультатов%", ФайлРезультатов);
		СтрокаКоманды = СтрЗаменить(СтрокаКоманды,"\\","\"); //если вдруг лишняя скобка
		
		//1свд
		КодВозврата = Неопределено;

		ЗапуститьПриложение(СтрокаКоманды, Параметры.КаталогИсполняемогоФайла, Истина, КодВозврата);

		ДобавитьЗаписьВЛог(Параметры, НСтр("ru='Окончание выгрузки конфигурации в XML'"), "Код возврата: "+?(КодВозврата = Неопределено, "Неопределено", КодВозврата));

		// Проверить успешность выполнения
		Если КодВозврата <> 0 Тогда

			ДобавитьЗаписьВЛог(Параметры, НСтр("ru = 'Ошибка выполнения пакетной операции'"), "", УровеньЖурналаРегистрации.Ошибка, Истина);
			ВызватьИсключение  НСтр("ru = 'При загрузке метаданных возникли ошибки (см. Журнал регистрации).
			|Выгрузка конфигурации в XML закончилась неудачей.'");
		КонецЕсли; 
		
		//Для каждого строка из параметры.проект.Расширения_ДВС цикл
		//	ВыгрузитьРасширения(Параметры,строка)
		//КонецЦикла;
		
	КонецЕсли;
